<template>
  <div class="terms">
    <h3>XXJJ积分平台服务条款</h3>欢迎使用XXJJ积分平台服务。在使用本服务前，请您务必仔细阅读并确保已充分理解并接受本服务条款的全部内容。如不同意本服务条款及XXJJ积分平台（下记“积分平台”）随时对其的修改或补充内容，您应当立即主动停止使用本服务。若您确认使用本服务即视为您已经阅读并同意本服务条款的全部内容，积分平台对本条款随时所做的任何修改和补充，本服务条款即在您与积分平台之间产生法律效力，成为双方均具有约束力的法律文件。
    一、服务条款范围及修改声明
    1.1 适用主体范围
    本服务条款是您与积分平台关于使用本服务所订立的协议。
    1.2 协议关系
    本服务条款的内容，包括但不仅限于与本服务、本条款相关的新协议、规则、规范以及积分平台可能不断发布的关于本服务相关协议、规则、规范等内容，前述内容一经予以正式发布，即为本条款不可分割的的组成部分，与其构成统一的整体。
    1.3 条款修改
    积分平台有权在本服务条款及各单项服务的相关条款被修改时，于用户登录平台时对用户进行提示。您在享受各项服务时，应及时查阅了解修改的内容，并自觉遵守修改后的服务条款及各单项服务的相关条款。如您继续使用本服务，则视为您已同意修改的内容；如您不同意修改内容，则有权停止使用本服务。
    二、服务使用、变更与中止
    2.1 服务内容、用户信息采集和使用
    用户可以获取积分平台提供的相关服务，其中包含但不限于以下服务：品牌资讯、活动浏览及报名、积分换礼、查找经销商、以及预约试乘试驾。
    在使用本服务前，您应当阅读并同意本协议的条款后，再按页面上的提示完成注册/登录操作。如不同意本协议，您无权使用本服务。如您触发注册/登录操作即表示您与积分平台达成协议，完全接受本协议的全部内容。积分平台给予您一项个人、不可转让及非排他性许可，以使用本服务。
    您通过具有定位功能的移动设备使用我们的服务时，通过GPS、LBS或WiFi等方式收集的您的地理位置信息，您可以通过关闭定位功能，停止对您的地理位置信息的收集。我们提供的某些基于位置的服务（例如自动定位城市功能）需要您提供个人信息方可正常使用。
    您在申请预约试乘试驾服务时，需要向我们提供相关个人信息，包括姓名、手机号、地址位置等，使我们有途径联系到您完成试驾等服务。如果您拒绝提供此类信息，我们将无法完成相关预约服务。
    您在确认参与活动时，需要向我们提供相关个人信息，包括姓名、手机号、地址位置等。如果您拒绝提供此类信息，我们将无法完成相关活动结果反馈及后续执行。
    您在确认下单兑换积分商品时，需要向我们提供相关个人信息，包括收货人姓名、手机号、收货地址等。如果您拒绝提供此类信息，我们将无法完成相关订单和商品交付。
    为展示您账户的订单信息，我们会收集您在使用我们服务过程中产生的订单信息用于向您展示及便于您对订单进行管理。
    除法律另有强制性规定或者积分平台另有明确告知外，双方约定如下：积分平台展示的商品和积分等信息仅仅是兑换信息的发布，您下单时须选择、确认您希望兑换的商品名称、兑换数量、兑换积分并完整准确地填写收货人姓名和联系方式、收货地址等信息；系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，仅是您向积分平台发出的兑换诉求；积分平台收到您的兑换订单后，只有在积分平台或其委托第三方将您在订单中兑换的商品从仓库实际向您发出时（以商品出库为标志），方视为您与积分平台之间就实际向您发出的商品建立了兑换交易关系；若您在一份订单里订购了多种商品且积分平台或其委托第三方只给您发出了部分商品时，您与积分平台之间仅就实际向您发出的商品建立了兑换交易关系；只有在积分平台或其委托第三方实际向您发出了订单中的其他商品时，您和积分平台之间才就订单中其他已实际向您发出的商品建立兑换交易关系。您可以随时登录积分平台账户，查看您的订单状态。
    2.2 服务变更及终止
    用户或积分平台可随时根据实际情况终止本服务。积分平台有权不经通知，单方终止向您提供某一项或多项服务；您同样有权不经通知，单方终止接受积分平台认证的服务。结束用户服务后，您使用本服务的权利立即终止，同时，积分平台不再就本服务对您承担任何义务。您理解并同意，本服务的变更或终止属于积分平台商业决策之内容。您不得因本服务的变更、终止而要求积分平台继续提供服务或承担任何形式的赔偿责任。
    三、用户信息保护
    3.1共享
    积分平台不会与其他公司、组织和个人分享您在使用本服务时提供的信息，包括但不仅限于姓名、注册手机号码、收货地址、车辆识别码等，但以下情况除外：
    • 在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。
    • 我们可能会根据法律法规规定，或按政府主管部门的强制性要求， 对外共享您的个人信息。
    • 与授权合作伙伴共享：仅为实现本政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。例如，在您用积分兑换平台商品时，我们必须与物流服务提供商共享您的个人信息才能安排送货，或者安排合作伙伴提供服务。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。
    对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。
    3.2转让
    我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
    • 在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；
    • 在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。
    3.3公开披露
    我们仅会在以下情况下，公开披露您的个人信息：
    • 获得您明确同意后；
    • 基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。
    3.4用户信息保护
    为了向您提供更好的个性化服务，系统可能通过cookies或其他方式自动采集的技术信息，包括设备或软件信息，例如您的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、您的IP地址和移动设备所用的版本和设备识别码。其中，cookies是一种能够让网站服务器把少量数据储存到客户端的硬盘或内存，或是从客户端的设备中读取数据的一种技术；是当您浏览网站时，由Web服务器置于您设备上的一个非常小的文本文件。为确保网站正常运转，我们会在您的计算机或移动设备上存储名为localstorage的小数据文件。localstorage是不同于cookies的存储数据文件，localstorage是一种没有时间限制的数据存储方式，可以将数据永久保存在客户端，不参与和服务器的通信。cookies是有时效性的，数据文件较小，且可以和服务器进行通信，两者采集和存储的数据并不相同借助于localstorage，网站能够存储您的账号基本信息，以及您的偏好或购物车内的商品等数据。我们不会将localstorage用于本政策所述目的之外的任何用途。您可以通过注销登录的方式，进行清除cookies和localstorage。当我们要将信息用于本政策未载明的其他用途时，会事先征求您的同意。当我们要将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。
    我们已使用符合业界标准的安全防护措施保护您提供的个人信息， 防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。我们同时对积分平台提供 https 安全浏览方式；我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人信息。
    我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
    互联网并非绝对安全的环境，请使用复杂密码，协助我们保证您的账号安全。
    互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
    在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以短信、电话等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。
    同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
    四、用户权利
    您有权选择是否使用本服务，如您选择使用本服务，您将对您的平台手机账号和密码安全负全部责任。
    若密码遗失，您可以在登录页面选择“忘记密码”根据提示重置密码。
    由于市场变化及各种以合理商业努力难以控制的因素的影响，积分平台无法保证您提交的订单信息中希望兑换的商品都会有货；如您拟兑换的商品发生缺货，您有权取消兑换订单。
    您有权在平台上修改个人账户中各项可修改信息，但信息内容必须遵守法律法规并符合网络道德，不得含有任何侮辱、威胁、淫秽、谩骂等侵害他人合法权益的文字。
    五、用户义务
    用户不得通过任何手段恶意使用XX积分平台服务，包括但不仅限于以牟利、炒作等为目的的多个账户注册登录。用户亦不能盗用其他用户账户。
    如您违反上述规定，则积分平台有权直接采取一切必要措施，包括但不仅限于暂停或查封您的账号，追求您的相关法律责任等。
    您有义务负责对您的平台手机账号和密码保密，并需要采取特定措施保护您的号码安全，包括但不限于妥善保管手机号码、通过平台下发的短信验证码、平台手机账号与密码、安装防病毒木马软件、定期更改密码等措施。
    在您下兑换订单时，请您仔细确认所兑换商品的名称、积分、数量、型号、规格、尺寸、联系地址、电话、收货人等信息。收货人与用户本人不一致的，收货人的行为和意思表示视为您的行为和意思表示，您应对收货人的行为及意思表示的法律后果承担连带责任。
    六、免责声明
    您理解并同意：如发现任何人未经授权使用您的手机账号和密码，或发生违反保密规定的任何其他情况，您会立即通知平台。平台不能也不会对因您未能遵守本款规定而发生的任何损失负责。您理解平台对您的请求采取行动需要合理时间，平台对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。
    您理解并同意：基于以下原因而造成的，包括但不限于利润、信誉、应用、数据损失或其他无形损失，积分平台不承担任何直接的、间接的、附带的、特别、衍生性的或惩罚性的赔偿责任（即使积分平台事先已被告知发生此种赔偿可能性亦然）：
    • 本服务无法使用；
    • 您的传输数据遭到未经授权的存取或篡改；
    • 本服务下涉及的境内外基础电信运营商的移动通信网络的故障、网络建设、调整服务功能、技术升级、技术缺陷、覆盖范围限制、不可抗力、计算机病毒、黑客攻击、用户所在位置、用户关机或其他非本服务技术能力范围内的事因等造成的服务中断、内容丢失、出现乱码；
    • 服务过程中出现的信息（包括但不限于用户发送的信息）删除或储存失败。
    积分平台或其委托的第三方将会把商品派送到您所指定的收货地址，因如下情况造成订单延迟或无法配送等情形，积分平台或其委托的第三方不承担延迟配送的责任：
    • 您填写的信息错误、不完整或者不详细等原因导致的；
    • 商品送达后无人签收或者收货人拒绝签收，导致无法配送或延迟配送的；
    • 情势变更因素导致的；
    • 自然灾害、交通戒严、突发战争等不可抗力因素导致的。
    另外积分平台保留判定用户的行为是否符合本协议要求的权利，如您违背了本协议内任意条款或您的行为违反了法律法规及相关监管规定的，积分平台有权终止对您提供本服务。
    为使用本服务，您必须经由为您提供网络接入服务的第三方（主要含互联网、WAP网、手机通信三种），并自行支付可能产生的网络通信费用。此外，您必须自行配备及负责与各网络连线所需之一切必要装备，如计算机、手机等装置。您理解并同意，不会因网络通讯费用及设备使用费用向积分平台追究任何形式的法律责任。
    在法律允许的范围内，服务平台有权对本服务条款、XXJJ积分平台积分规则进行解释。
  </div>
</template>

<style>
.terms {
  padding: 10px;
}
</style>

